package firstStep;

public class AnonClass {
    //Анонимные классы нужн когда мы хотим создать внутри большого класса какой то объект в единственном экземпляре

    //Car FlyCar = new Car(someArg);  Летающая машинка всего 1

    // Car FlyCar = new Car(someArg) {
        //@Override
        //public void MethodName(){
            //Функционал ТОЛЬКО этой машины (например ее передвижение) 
            //Мы переписали функцию движения (для всех) на функцию движения только для нее
        //}
    //} ;
}
